In [2]:
import numpy as np
import pandas as pd

###### 연습 문제 1   
임의로 두 개의 시리즈 객체를 만든다.   
모두 문자열 인덱스를 가져야 하며 두 시리즈에 공통적으로 포함되지 않는 라벨이 있어야 한다.  
위에서 만든 두 시리즈 객체를 이용하여 사칙 연산을 한다.

In [3]:
s1 = pd.Series({'은총':100,'진원':10, '권재':50,'른산':60})
s1

은총    100
진원     10
권재     50
른산     60
dtype: int64

In [4]:
s2 = pd.Series({'은총':100,'진원':10, '권재':70,'른산':80})
s2

은총    100
진원     10
권재     70
른산     80
dtype: int64

In [5]:
s1-s2

은총     0
진원     0
권재   -20
른산   -20
dtype: int64

###### 연습 문제 2  

다음 조건을 만족하는 임의의 데이터프레임을 하나 만든다.  
  
- 열의 갯수와 행의 갯수가 각각 5개 이상이어야 한다.  
- 열에는 정수, 문자열, 실수 자료형 데이터가 각각 1개 이상씩 포함되어 있어야 한다.

In [6]:
data = {
    "sentex": [80, 90, 100],
    "corey": [50, 60, 70],
    "statquest": [30,40,50],
    "년도": ['2016','2017','2018']
}
columns = ["sentex", "corey", "statquest"]
index = ["2016", "2017", "2018"]
df = pd.DataFrame(data, index=index, columns=columns)
df

      sentex  corey  statquest
2016      80     50         30
2017      90     60         40
2018     100     70         50

###### 연습 문제 3  

다음 데이터프레임에서 지정하는 데이터를 뽑아내거나 처리하라.

In [7]:
data = {
    "국어": [80, 90, 70, 30],
    "영어": [90, 70, 60, 40],
    "수학": [90, 60, 80, 70],
}
columns = ["국어", "영어", "수학"]
index = ["춘향", "몽룡", "향단", "방자"]
df = pd.DataFrame(data, index=index, columns=columns)

 - 모든 학생의 수학 점수를 시리즈로 나타낸다.
 - 모든 학생의 국어와 영어 점수를 데이터 프레임으로 나타낸다.
 - 모든 학생의 각 과목 평균 점수를 새로운 열로 추가한다.
 - 방자의 영어 점수를 80점으로 수정하고 평균 점수도 다시 계산한다.
 - 춘향의 점수를 데이터프레임으로 나타낸다.
 - 향단의 점수를 시리즈로 나타낸다.

In [8]:
#모든 학생의 수학 점수를 시리즈로 나타낸다.
df['수학']

춘향    90
몽룡    60
향단    80
방자    70
Name: 수학, dtype: int64

In [9]:
#모든 학생의 국어와 영어 점수를 데이터 프레임으로 나타낸다.
df[['국어','영어']]

    국어  영어
춘향  80  90
몽룡  90  70
향단  70  60
방자  30  40

In [10]:
#모든 학생의 각 과목 평균 점수를 새로운 열로 추가한다.
df['평균'] = (df['국어']+df['영어']+df['수학'])/3
df

    국어  영어  수학         평균
춘향  80  90  90  86.666667
몽룡  90  70  60  73.333333
향단  70  60  80  70.000000
방자  30  40  70  46.666667

In [11]:
#방자의 영어 점수를 80점으로 수정하고 평균 점수도 다시 계산한다.
df['영어']['방자'] = 80
df['평균'] = (df['국어']+df['영어']+df['수학'])/3
df

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy

    국어  영어  수학         평균
춘향  80  90  90  86.666667
몽룡  90  70  60  73.333333
향단  70  60  80  70.000000
방자  30  80  70  60.000000

In [12]:
#춘향의 점수를 데이터프레임으로 나타낸다.
df[0:1]

    국어  영어  수학         평균
춘향  80  90  90  86.666667

In [13]:
#향단의 점수를 시리즈로 나타낸다.
df.loc['향단']

국어    70.0
영어    60.0
수학    80.0
평균    70.0
Name: 향단, dtype: float64

###### 연습 문제 4

- 모든 행과 열에 라벨을 가지는 5 x 5 이상의 크기를 가지는 데이터프레임을 만든다.
- 10가지 이상의 방법으로 특정한 행과 열을 선택한다.

In [14]:
df = pd.DataFrame(np.arange(0,25).reshape(5,5), index = ['a','b','c','d','e'], columns=['A','B','C','D','E'])

In [15]:
df['A']

a     0
b     5
c    10
d    15
e    20
Name: A, dtype: int32

In [16]:
df.A

a     0
b     5
c    10
d    15
e    20
Name: A, dtype: int32

In [17]:
df.loc['a']

A    0
B    1
C    2
D    3
E    4
Name: a, dtype: int32

In [18]:
df.iloc[0,:]

A    0
B    1
C    2
D    3
E    4
Name: a, dtype: int32

In [19]:
df["a":"b"]

   A  B  C  D  E
a  0  1  2  3  4
b  5  6  7  8  9

In [20]:
df.at["a","A"]

0

In [21]:
df.iat[0,0]

0

In [22]:
df[:1]

   A  B  C  D  E
a  0  1  2  3  4

In [23]:
df[0:1]

   A  B  C  D  E
a  0  1  2  3  4

###### 연습 문제 5

다음 명령으로 타이타닉호 승객 데이터를 데이터프레임으로 읽어온다. 이 명령을 실행하려면 seaborn 패키지가 설치되어 있어야 한다.  

```import seaborn as sns
titanic = sns.load_dataset("titanic")```
  
  
타이타닉호 승객 데이터의 데이터 값을 각 열마다 구해본다.

In [24]:
import seaborn as sns
titanic = sns.load_dataset('titanic')

In [26]:
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [25]:
titanic.count()

survived       891
pclass         891
sex            891
age            714
sibsp          891
parch          891
fare           891
embarked       889
class          891
who            891
adult_male     891
deck           203
embark_town    889
alive          891
alone          891
dtype: int64

###### 연습 문제 6

타이타닉호 승객중 성별(sex) 인원수, 나이별(age) 인원수, 선실별(class) 인원수, 사망/생존(alive) 인원수를 구하라.

In [30]:
import seaborn as sns
titanic = sns.load_dataset('titanic')

In [31]:
#성별(sex) 인원수
titanic.sex.value_counts()

male      577
female    314
Name: sex, dtype: int64

In [32]:
#나이별(age) 인원수
titanic.age.value_counts()

24.00    30
22.00    27
18.00    26
19.00    25
30.00    25
28.00    25
21.00    24
25.00    23
36.00    22
29.00    20
32.00    18
27.00    18
35.00    18
26.00    18
16.00    17
31.00    17
20.00    15
33.00    15
23.00    15
34.00    15
39.00    14
17.00    13
42.00    13
40.00    13
45.00    12
38.00    11
50.00    10
2.00     10
4.00     10
47.00     9
         ..
71.00     2
59.00     2
63.00     2
0.83      2
30.50     2
70.00     2
57.00     2
0.75      2
13.00     2
10.00     2
64.00     2
40.50     2
32.50     2
45.50     2
20.50     1
24.50     1
0.67      1
14.50     1
0.92      1
74.00     1
34.50     1
80.00     1
12.00     1
36.50     1
53.00     1
55.50     1
70.50     1
66.00     1
23.50     1
0.42      1
Name: age, Length: 88, dtype: int64

In [33]:
#선실별(class) 인원수
titanic['class'].value_counts()

Third     491
First     216
Second    184
Name: class, dtype: int64

In [34]:
#사망/생존(alive) 인원수
titanic['alive'].value_counts()

no     549
yes    342
Name: alive, dtype: int64

###### 연습 문제 7

bins = [1, 15, 25, 35, 60, 99]  

labels = ["미성년자", "청년", "중년", "장년", "노년"]  

타이타닉호 승객을 사망자와 생존자 그룹으로 나누고 각 그룹에 대해 '미성년자', '청년', '중년', '장년', '노년' 승객의 비율을 구한다.  
각 그룹 별로 비율의 전체 합은 1이 되어야 한다.

In [35]:
import seaborn as sns
titanic = sns.load_dataset('titanic')

In [36]:
bins = [1, 15, 25, 35, 60, 99]
labels = ["미성년자", "청년", "중년", "장년", "노년"]

In [38]:
alive =  titanic.loc[titanic.alive == 'yes',['alive','age']]
dead =  titanic.loc[titanic.alive == 'no',['alive','age']]

In [39]:
alive_ = pd.cut(alive.age, bins, labels=labels)
alive_.dropna(inplace = True)
dead_ = pd.cut(dead.age, bins, labels=labels)
dead_.dropna(inplace = True)

In [40]:
pd.value_counts(alive_)/sum(pd.value_counts(alive_))

중년      0.298561
장년      0.280576
청년      0.269784
미성년자    0.133094
노년      0.017986
Name: age, dtype: float64

In [41]:
pd.value_counts(dead_)/sum(pd.value_counts(dead_))

청년      0.338863
장년      0.277251
중년      0.267773
미성년자    0.075829
노년      0.040284
Name: age, dtype: float64

###### 연습 문제 8 

5명의 학생의 국어, 영어, 수학 점수를 나타내는 데이터프레임을 다음과 같이 만든다.  
  
1. 학생 이름을 나타내는 열을 포함시키지 않고 데이터프레임 df_score1 을 생성한 후, df_score1.index 속성에 학생 이름을 나타내는 열을 지정하여 인덱스를 지정한다. reset_index 명령으로 이 인덱스 열을 명령으로 일반 데이터열로 바꾸여 데이터프레임 df_score2을 만든다.  
2. 학생 이름을 나타내는 열이 일반 데이터 열을 포함하는 데이터프레임 df_score2에 set_index 명령을 적용하여 다시 학생 이름을 나타내는 열을 인덱스로 변경한다.

In [48]:
df_score1 = pd.DataFrame({'국어':[100,80,90],'영어':[80,70,90], '수학':[80,90,70]})
df_score1.index = ['a','b','c']
df_score1.index.name = '과목'

df_score2 = df_score1.reset_index()
df_score2.set_index('과목',inplace = True)

In [49]:
df_score1

     국어  영어  수학
과목
a   100  80  80
b    80  70  90
c    90  90  70

In [50]:
df_score2

     국어  영어  수학
과목
a   100  80  80
b    80  70  90
c    90  90  70

##### 연습 문제 2  

A 반 학생 5명과 B반 학생 5명의 국어, 영어, 수학 점수를 나타내는 데이터프레임을 다음과 같이 만든다.  
  
1. "반", "번호", "국어", "영어", "수학" 을 열로 가지는 데이터프레임 df_score3을 만든다.
2. df_score3을 변형하여 1차 행 인덱스로 "반"을 2차 행 인덱스로 "번호"을 가지는 데이터프레임 df_score4을 만든다.

3. 데이터 프레임 df_score4에 각 학생의 평균을 나타내는 행을 오른쪽에 추가한다.

4. df_score3을 변형하여 행 인덱스로 "번호"를, 1차 열 인덱스로 "국어", "영어", "수학"을, 2차 열 인덱스로 "반"을 가지는 데이터프레임 df_score5을 만든다.

5. 데이터 프레임 df_score5에 각 반별 각 과목의 평균을 나타내는 행을 아래에 추가한다.

In [51]:
df_score3 = pd.DataFrame({'국어':[100,80,90,80,50,80,85,90,95,50],
                          '영어':[80,70,90,100,90,100,90,95,70,60], 
                          '수학':[80,90,70,60,90,60,80,85,90,100],
                          '번호':[1,2,3,4,5,1,2,3,4,5], 
                          '반':['A','A','A','A','A','B','B','B','B','B']})

In [52]:
df_score4 = df_score3.set_index(['반','번호'])
df_score4.columns.name = '과목'
df_score4

과목     국어   영어   수학
반 번호
A 1   100   80   80
  2    80   70   90
  3    90   90   70
  4    80  100   60
  5    50   90   90
B 1    80  100   60
  2    85   90   80
  3    90   95   85
  4    95   70   90
  5    50   60  100

In [53]:
df_score5 = df_score3.set_index(['반','번호'])
df_score5 = df_score5.unstack('반')
df_score5

     국어       영어       수학
반     A   B    A    B   A    B
번호
1   100  80   80  100  80   60
2    80  85   70   90  90   80
3    90  90   90   95  70   85
4    80  95  100   70  60   90
5    50  50   90   60  90  100